<div class="content-wrapper">
    <div class="container-fluid">
        <div class="card mb-3">
            <div class="card-header">Задача: Web-интерфейс БД зарегистрированных пользователей сайта</div>
            <div class="card-body">
                <div class="row">
                    <div class="col-sm-4">
                        <p>Нужно создать Web-интерфейс для администрирования записей в базе данных зарегистрированных
                            пользователей сайта.</p>
                        <p>База данных содержит таблицу с данными о зарегистрированных пользователях.</p>
                        <p>Набор полей для пользователя:</p>
                        <ul>
                            <li>1. Логин пользователя (должен быть уникальным).</li>
                            <li>2. Пароль пользователя.</li>
                            <li>3. Персональные данные (имя, фамилия, пол, дата рождения)</li>
                        </ul>
                        <p>Интерфейс должен реализовывать следующую функциональность:</p>
                        <ul>
                            <li>— Просмотр списка зарегистрированных пользователей (с постраничной разбивкой
                                и сортировкой).
                            </li>
                            <li>— Просмотр информации по выбранному пользователю.</li>
                            <li>— Добавление новой записи пользователя.</li>
                            <li>— Редактирование записи пользователя.</li>
                            <li>— Удаление записи пользователя.</li>
                        </ul>
                        <p>Интерфейс должен быть доступен пользователю с правами администратора только
                            после прохождения аутентификации.</p>
                    </div>
                </div>
            </div>
        </div>
    </div>
</div>